import React, { useEffect } from "react";

const PrivacyPolicyTH = () => {
  useEffect(() => {
    document.title = "นโยบายความเป็นส่วนตัว";
  }, []);

  return (
    <div>
      <div style={styles.container}>
      <h1 style={{ ...styles.title, color:"#00A397" }}>นโยบายความเป็นส่วนตัว</h1>
      <p style={styles.text}>
      กองบริหารการสาธารณสุขและมูลนิธิเพื่อการประเมินเทคโนโลยีและนโยบายด้านสุขภาพ (ต่อไปนี้จะเรียกว่า “ผู้ให้บริการเว็บไซต์”) ซึ่งเป็นผู้ให้บริการเว็บไซต์เว็บไซต์นี้ ขอเรียนว่า ผู้ให้บริการเว็บไซต์ในฐานะ “ผู้ควบคุมข้อมูลส่วนบุคคล” เคารพความเป็นส่วนตัวของท่านในฐานะ “เจ้าของข้อมูลส่วนบุคคล” และตระหนักดีว่าข้อมูลส่วนบุคคลของท่านมีความสำคัญอย่างยิ่ง
      </p>
      <p style={styles.text}>
      ดังนั้น ผู้ให้บริการเว็บไซต์จึงได้จัดทำประกาศความเป็นส่วนตัวฉบับนี้ (“นโยบาย”) เพื่อชี้แจงรายละเอียด วัตถุประสงค์ และวิธีการเก็บรวบรวม ใช้ และ/หรือเปิดเผย (เรียกรวมกันว่า “ประมวลผล”) ข้อมูลส่วนบุคคลของท่าน เช่น ข้อมูลการบัญชีผู้ใช้งาน หรือข้อมูลการเข้าใช้งานเว็บไซต์ เป็นต้น รวมถึงแจ้งสิทธิที่ท่านมีและช่องทางการติดต่อผู้ให้บริการเว็บไซต์ โดยมีรายละเอียดดังต่อไปนี้
      </p>
      <h2 style={styles.subtitle}>ข้อ 1. ประเภทและแหล่งที่มาของข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์จะเก็บรวบรวมข้อมูลส่วนบุคคลจากท่านโดยตรง ซึ่งรวมถึงข้อมูลที่ท่านได้ให้ไว้กับผู้ให้บริการเว็บไซต์โดยตรง หรืออาจรวบรวมข้อมูลส่วนบุคคลจากแหล่งอื่นที่ไม่ใช่จากเจ้าของข้อมูลส่วนบุคคลโดยตรง เช่น จากหน่วยงานต้นสังกัดของท่าน เฉพาะในกรณีที่มีความจำเป็นด้วยวิธีการตามที่กฎหมายกำหนด
      </p>
      <p style={styles.text}>
      อนึ่ง ข้อมูลที่เก็บรวบรวมข้อมูลส่วนบุคคลทั่วไปซึ่งรวมถึงแต่ไม่จำกัดเฉพาะข้อมูลดังต่อไปนี้
      </p>
      <ul style={styles.list}>
        <li>ข้อมูลส่วนตัว เช่น ชื่อ นามสกุล ตำแหน่งงาน</li>
        <li>
        ข้อมูลการติดต่อ เช่น สถานที่ทำงาน หมายเลขโทรศัพท์ อีเมล
        </li>
        <li>ข้อมูลบัญชีผู้ใช้งาน (User Account ID) และรหัสผ่าน (Password)</li>
        <li>
        ข้อมูลเกี่ยวกับอุปกรณ์และซอฟต์แวร์ ข้อมูลหมายเลขประจำเครื่องคอมพิวเตอร์ (IP address) ข้อกำหนดเฉพาะทางเทคนิคและข้อมูลเฉพาะที่ใช้ระบุตัวตน เช่น คุกกี้ (Cookie) เว็บบีคอน (web beacon) ล็อก (Log) ไอดีอุปกรณ์ (Device ID) ประเภทของอุปกรณ์ เครือข่าย ข้อมูลการเชื่อมต่อ ข้อมูลการเข้าถึง การเข้าสู่ระบบ (Login log) เวลาที่เข้าถึง ระยะเวลาที่ใช้บนหน้าเพจของผู้ให้บริการเว็บไซต์
        </li>
        <li>
        ข้อมูลรายละเอียดการใช้งาน ประวัติการค้นหา ข้อมูลการเรียกดู การตอบสนองต่อการประชาสัมพันธ์ของผู้ให้บริการเว็บไซต์ รวมถึง เนื้อหาที่ท่านเข้าชม ลิงค์ที่กดเข้าชม ฟีเจอร์ (Features) ที่ท่านใช้ และข้อมูลการขอใช้บริการ ข้อมูลการใช้งานเว็บไซต์
        </li>
        <li>
        ข้อมูลอื่น ๆ ที่ถือว่าเป็นข้อมูลส่วนบุคคลภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคลตามที่จำเป็นเพื่อการให้บริการบนเว็บไซต์
        </li>
      </ul>
      <h2 style={styles.subtitle}>
      ข้อ 2. วัตถุประสงค์และฐานในการประมวลผลข้อมูลส่วนบุคคล
      </h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์ประมวลผลข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็นภายใต้วัตถุประสงค์อันชอบด้วยกฎหมาย โดยจำแนกวัตถุประสงค์ตามฐานทางกฎหมายได้ดังต่อไปนี้
      </p>
      <h2 style={styles.subtitle2}>
        1. ฐานการปฏิบัติตามสัญญาหรือคำขอของท่าน
      </h2>
      <p style={styles.text2}>1. การให้บริการต่างๆ บนเว็บไซต์</p>
      <p style={styles.text2}>
        2. การตอบรับหรือดำเนินการตามที่ท่านได้ร้องขอไว้กับผู้ให้บริการเว็บไซต์
      </p>
      <h2 style={styles.subtitle2}>2. ฐานปฏิบัติหน้าที่ตามกฎหมาย</h2>
      <p style={styles.text2}>
        1. การปฏิบัติตามกฎหมาย กฎระเบียบ ข้อบังคับ ทั้งในและต่างประเทศที่ใช้บังคับแก่ผู้ให้บริการเว็บไซต์ เช่น การเก็บรักษาข้อมูลจราจรทางคอมพิวเตอร์ตามพระราชบัญญัติว่าด้วยการกระทำผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2560
      </p>
      <p style={styles.text2}>
        2. การปฏิบัติตามคำสั่งของผู้มีอำนาจตามกฎหมาย เช่น คำสั่งศาล คำสั่งของหน่วยงานรัฐ หน่วยงานที่มีหน้าที่กำกับดูแลผู้ให้บริการเว็บไซต์ หรือพนักงานเจ้าหน้าที่ผู้มีอำนาจ
      </p>
      <h2 style={styles.subtitle2}>3. ฐานประโยชน์โดยชอบด้วยกฎหมาย</h2>
      <p style={styles.text2}>
        1. การตอบข้อร้องเรียน ข้อซักถาม หรือข้อเสนอแนะใดๆ ของท่าน
      </p>
      <p style={styles.text2}>
        2. การแจ้งข่าวสารและการประชาสัมพันธ์กิจกรรมของผู้ให้บริการเว็บไซต์
      </p>
      <p style={styles.text2}>
        3. การพัฒนาและปรับปรุงเว็บไซต์  เพื่อเพิ่มประสิทธิภาพการใช้งานของผู้ใช้งานด้วยวิธีการทางอิเล็กทรอนิกส์แก่ท่านให้ดียิ่งขึ้น
      </p>
      <p style={styles.text2}>
        4. การเก็บรักษาข้อมูลเพื่อป้องกันการฉ้อฉลหรือการกระทำอันไม่ประสงค์ดี เช่น การเฝ้าระวังการโจมตีทางไซเบอร์
      </p>
      <p style={styles.text2}>
        5. การดำเนินการเกี่ยวกับสิทธิเรียกร้องตามกฎหมาย การดำเนินคดี และการบังคับคดี
      </p>
      <h2 style={styles.subtitle2}>
        4. ฐานความจำเป็นเพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะ
      </h2>
      <p style={styles.text2}>
        1. การให้บริการหรือปฏิบัติหน้าที่ใดๆ ของผู้ให้บริการเว็บไซต์โดยใช้อำนาจรัฐเพื่อประโยชน์สาธารณะ
      </p>
      <p style={styles.text}>
      ในกรณีที่ท่านต้องให้ข้อมูลส่วนบุคคลเพื่อการปฏิบัติหน้าที่ตามกฎหมายหรือสัญญา หรือเพื่อความจำเป็นในการเข้าทำสัญญา หากท่านไม่ประสงค์ที่จะให้ข้อมูลส่วนบุคคลดังกล่าวแก่ผู้ให้บริการเว็บไซต์ หรือคัดค้านการดำเนินการประมวลผลตามวัตถุประสงค์ของกิจกรรม อาจมีผลทำให้ผู้ให้บริการเว็บไซต์ไม่สามารถปฏิบัติหน้าที่ภายใต้สัญญาที่ได้เข้าทำกับท่าน หรือไม่สามารถเข้าทำสัญญากับท่านได้ (แล้วแต่กรณี) ในกรณีดังกล่าว ผู้ให้บริการเว็บไซต์อาจมีความจำเป็นต้องปฏิเสธการเข้าทำสัญญาหรือการให้สิทธิประโยชน์ที่เกี่ยวข้องกับท่าน ไม่ว่าทั้งหมดหรือบางส่วน ตลอดจนอาจส่งผลกระทบต่อการปฏิบัติหน้าที่ตามกฎหมายของผู้ให้บริการเว็บไซต์ได้
      </p>
      <h2 style={styles.subtitle}>ข้อ 3. การเปิดเผยข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์อาจเปิดเผยข้อมูลส่วนบุคคลของท่าน ภายใต้วัตถุประสงค์ที่กำหนดและตามกฎหมายให้แก่บุคคลและหน่วยงาน ดังต่อไปนี้
      </p>
      <ul style={styles.list}>
        <li>
        ผู้ประมวลผลข้อมูลส่วนบุคคลที่ผู้ให้บริการเว็บไซต์มอบหมายหรือว่าจ้าง รวมถึง  ผู้ที่ทำหน้าที่ในนามผู้ให้บริการเว็บไซต์ หรือร่วมกับผู้ให้บริการเว็บไซต์ เพื่อดำเนินวัตถุประสงค์ที่เกี่ยวข้องตามที่ระบุในประกาศฉบับนี้ และมีความจำเป็นต้องได้รับข้อมูลส่วนบุคคลของท่าน เช่น การให้บริการด้านเทคโนโลยีสารสนเทศ บริการบันทึกข้อมูล เป็นต้น
        </li>
        <li>
        หน่วยงานของรัฐที่มีหน้าที่กำกับดูแลตามกฎหมาย หรือที่ร้องขอให้เปิดเผยข้อมูลส่วนบุคคลโดยอาศัยอำนาจตามกฎหมาย หรือที่เกี่ยวข้องกับกระบวนการทางกฎหมาย หรือที่ได้รับอนุญาตตามกฎหมายที่เกี่ยวข้อง
        </li>
        <li>
        ที่ปรึกษาหรือผู้เชี่ยวชาญที่ให้คำแนะนำในการดำเนินการของผู้ให้บริการเว็บไซต์ เช่น ที่ปรึกษากฎหมาย ที่ปรึกษาทางบัญชี รวมถึงที่ปรึกษาวิชาชีพเฉพาะทางอื่นๆ เป็นต้น
        </li>
        <li>
        หน่วยงานหรือองค์กรที่เป็นช่องทางประชาสัมพันธ์กิจกรรมของผู้ให้บริการเว็บไซต์ รวมถึงผู้ให้บริการเว็บไซต์สื่อสังคมออนไลน์ (social media)
        </li>
      </ul>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์จะกำหนดให้ผู้ที่ได้รับข้อมูลมีมาตรการปกป้องข้อมูลของท่านอย่างเหมาะสม และประมวลผลข้อมูลส่วนบุคคลดังกล่าวเท่าที่จำเป็นเท่านั้น และจะดำเนินการเพื่อป้องกันไม่ให้มีการประมวลข้อมูลส่วนบุคคลของท่านโดยปราศจากอำนาจหรือโดยมิชอบด้วยกฎหมายคุ้มครองข้อมูลส่วนบุคคลหรือกฎหมายอื่นใด 
      </p>
      <h2 style={styles.subtitle}>
      ข้อ 4 การส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ
      </h2>
      <p style={styles.text}>
      ในบางกรณีผู้ให้บริการเว็บไซต์อาจจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศเพื่อดำเนินการตามวัตถุประสงค์หรือกิจกรรมของผู้ให้บริการเว็บไซต์ เช่น การส่งข้อมูลไปจัดเก็บที่ cloud server ในต่างประเทศ
      </p>
      <p style={styles.text}>
      อย่างไรก็ตาม ผู้ให้บริการเว็บไซต์จะส่งหรือโอนข้อมูลส่วนบุคคลไปยังประเทศปลายทางที่มีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอ หรือมิฉะนั้น จะดำเนินการเพื่อให้ข้อมูลส่วนบุคคลที่ส่งหรือโอนไปมีมาตรการคุ้มครองข้อมูลส่วนบุคคลอย่างเพียงพอตามมาตรฐานที่กฎหมายกำหนด รวมทั้งมีการจัดทำสัญญากับบุคคลที่เกี่ยวข้อง เพื่อให้มีการปฏิบัติตามมาตรการป้องกันและคุ้มครองข้อมูลส่วนบุคคลตามที่ผู้ให้บริการเว็บไซต์กำหนด
      </p>
      <h2 style={styles.subtitle}>ข้อ 5 ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์จะเก็บรักษาข้อมูลส่วนบุคคลเท่าที่มีความจำเป็นเพื่อวัตถุประสงค์ตามที่ระบุในประกาศฉบับนี้ โดยผู้ให้บริการเว็บไซต์จะเก็บรักษาข้อมูลไว้ตามระยะเวลาที่อาจคาดหมายได้ตามมาตรฐานของการเก็บรวบรวม (เช่น อายุความตามกฎหมายทั่วไปสูงสุด 10 ปี)  จากนั้นข้อมูลของท่านจะถูกลบหรือทำลายตามที่กฎหมายกำหนด
      </p>
      <h2 style={styles.subtitle}>ข้อ 6 การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์จะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้โดยมีมาตรการเชิงเทคนิค (Technical Measure) และมาตรการเชิงบริหารจัดการ (Organizational Measure) ที่เหมาะสมตามที่กฎหมายกำหนด เพื่อรักษาความมั่นคงปลอดภัยในข้อมูลส่วนบุคคล และเพื่อป้องกันการละเมิดข้อมูลส่วนบุคคล การสูญหาย การเข้าถึง ทำลาย ใช้ แปลง แก้ไข การนำข้อมูลไปใช้ หรือเปิดเผยข้อมูลโดยไม่มีอำนาจหรือโดยไม่ชอบ
      </p>
      <p style={styles.text}>
      นอกจากนี้ เมื่อ ผู้ให้บริการเว็บไซต์เปิดเผยข้อมูลส่วนบุคคลแก่บุคคลภายนอก ไม่ว่าเพื่อการให้บริการตามพันธกิจ ตามสัญญา หรือข้อตกลงในรูปแบบอื่น ผู้ให้บริการเว็บไซต์จะกำหนดมาตรการรักษาความปลอดภัยข้อมูลส่วนบุคคลและการรักษาความลับที่เหมาะสมและเป็นไปตามที่กฎหมายกำหนด เพื่อให้ข้อมูลส่วนบุคคลของท่านจะมีความมั่นคงปลอดภัยอยู่เสมอ
      </p>
      <h2 style={styles.subtitle}>ข้อ 7 ความสามารถของผู้ใช้งาน</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์ไม่มีเจตนาที่จะประมวลผลข้อมูลของผู้เยาว์ คนไร้ความสามารถ หรือคนเสมือนไร้ความสามารถตามกฎหมาย เว้นแต่ผู้ให้บริการเว็บไซต์ได้รับความยินยอมจากผู้ปกครอง ผู้ใช้อำนาจปกครอง ผู้อนุบาลหรือผู้พิทักษ์ (แล้วแต่กรณี) ที่มีอำนาจกระทำแทนท่าน หรือกฎหมายอนุญาตให้ผู้ให้บริการเว็บไซต์สามารดำเนินการได้
      </p>
      <h2 style={styles.subtitle}>ข้อ 8 การใช้งานคุกกี้ (Cookies)</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์อาจเก็บรวบรวมและใช้งานคุกกี้ หรือเทคโนโลยีอื่นใดที่มีลักษณะใกล้เคียงกัน เมื่อท่านมีการใช้งานเว็บไซต์ของผู้ให้บริการเว็บไซต์ เพื่อช่วยให้สามารถจดจำการใช้งานและพัฒนาประสิทธิภาพการทำงานของเว็บไซต์ให้ตอบสนองต่อความต้องการและประสบการณ์ในการใช้งานที่ดีของท่าน
      </p>
      <h2 style={styles.subtitle}>ข้อ 9 สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      เจ้าของข้อมูลส่วนบุคคลหรือบุคคลผู้มีอำนาจกระทำการแทนสามารถติดต่อยื่นคำร้องขอใช้สิทธิต่างๆ ได้ผ่านช่องทางตามที่ระบุไว้ในหัวข้อ “การติดต่อสอบถามหรือใช้สิทธิ” โดยรายละเอียดของสิทธิมีดังต่อไปนี้
      </p>
      <p style={styles.subtitle2}><strong>1. สิทธิในการได้รับแจ้งข้อมูล (Right to be informed)</strong> </p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลมีสิทธิได้รับแจ้งและสอบถามรายละเอียดเกี่ยวกับการเก็บรวบรวม ใช้และเปิดเผยข้อมูลส่วนบุคคล
      </p>
      <p style={styles.subtitle2}><strong>2. สิทธิในการขอเข้าถึงข้อมูลส่วนบุคคล (Right to Access)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิขอเข้าถึง รับสำเนาและขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลที่ผู้ให้บริการเว็บไซต์เก็บรวบรวมไว้
      </p>
      <p style={styles.subtitle2}><strong>3. สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน (Right to Rectification)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิขอให้แก้ไขข้อมูลส่วนบุคคลเพื่อให้มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิดได้
      </p>
      <p style={styles.subtitle2}><strong>4. สิทธิในการลบหรือทำลายข้อมูลส่วนบุคคล (Right to Erasure)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิขอให้ผู้ให้บริการเว็บไซต์ลบหรือทำลายข้อมูลส่วนบุคคลของตน หรือทำให้ข้อมูลส่วนบุคคลของตนไม่สามารถระบุตัวบุคคลได้
      </p>
      <p style={styles.subtitle2}><strong>5. สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคล (Right to Restriction of Processing)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลของตน ทั้งนี้ ในกรณีดังต่อไปนี้
      </p>
      <p style={styles.subtitle3}>
        1. เมื่อผู้ให้บริการเว็บไซต์กำลังตรวจสอบคำร้องขอแก้ไขข้อมูลข้อมูลส่วนบุคคลให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน (Right to Rectification)
      </p>
      <p style={styles.subtitle3}>
        2. เมื่อผู้ให้บริการเว็บไซต์ประมวลผลข้อมูลส่วนบุคคลของเจ้าของข้อมูลโดยผิดกฎหมาย
      </p>
      <p style={styles.subtitle3}>
        3. เมื่อข้อมูลส่วนบุคคลไม่มีความจำเป็นกับผู้ให้บริการเว็บไซต์อีกต่อไป แต่เจ้าของข้อมูลประสงค์ให้ผู้ให้บริการเว็บไซต์เก็บข้อมูลต่อไปเพื่อวัตถุประสงค์ตามที่กฎหมายอนุญาต
      </p>
      <p style={styles.subtitle3}>
        4. เมื่อผู้ให้บริการเว็บไซต์กำลังตรวจสอบคำร้องขอคัดค้านการประมวลผล (Right to Object)
      </p>
      <p style={styles.subtitle2}><strong>6. สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล (Right to Object)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิคัดค้านการเก็บรวบรวม ใช้หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับตน ในกรณีที่ผู้ให้บริการเว็บไซต์ดำเนินการภายใต้ฐานประโยชน์โดยชอบด้วยกฎหมาย หรือเพื่อวัตถุประสงค์เกี่ยวกับการศึกษาวิจัยทางวิทยาศาสตร์ ประวัติศาสตร์ หรือสถิติ
      </p>
      <p style={styles.subtitle2}><strong>7. สิทธิในการขอรับ ส่งหรือโอนข้อมูลส่วนบุคคล (Right to Data Portability)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิในการขอให้ผู้ให้บริการเว็บไซต์ส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบที่สามารถอ่านหรือใช้งานโดยทั่วไปได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติไปยังผู้ควบคุมข้อมูลส่วนบุคคลรายอื่นได้
      </p>
      <p style={styles.subtitle2}><strong>8. สิทธิในการร้องเรียน (Right to File a Complaint)</strong></p>
      <p style={styles.subtitle2}>
      เจ้าของข้อมูลส่วนบุคคลมีสิทธิในการร้องเรียนต่อผู้ให้บริการเว็บไซต์เพื่อตรวจสอบ ชี้แจง หรือแก้ไขข้อกังวลจากผู้ให้บริการเว็บไซต์ รวมถึงมีสิทธิร้องเรียนต่อคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล หากการประมวลผลข้อมูลส่วนบุคคลของผู้ให้บริการเว็บไซต์ไม่เป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
      </p>
      <p style={styles.text}>
      ในกรณีที่เจ้าของข้อมูลส่วนบุคคลยื่นคำร้องขอใช้สิทธิภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล เมื่อผู้ให้บริการเว็บไซต์ได้รับคำร้องขอดังกล่าวแล้ว จะดำเนินการภายในระยะเวลาที่กฎหมายกำหนด อนึ่ง ผู้ให้บริการเว็บไซต์สงวนสิทธิที่จะปฏิเสธหรือไม่ดำเนินการตามคำร้องขอดังกล่าว รวมถึงเรียกเก็บค่าธรรมเนียมได้ในกรณีที่กฎหมายกำหนด
      </p>
      <h2 style={styles.subtitle}>ข้อ 10 การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</h2>
      <p style={styles.text}>
      ผู้ให้บริการเว็บไซต์อาจพิจารณาปรับปรุง แก้ไขหรือเปลี่ยนแปลงประกาศความเป็นส่วนตัวเป็นครั้งคราวเพื่อให้สอดคล้องกับแนวปฏิบัติภายในและกฎหมายคุ้มครองข้อมูลส่วนบุคคล โดยผู้ให้บริการเว็บไซต์จะแจ้งให้ท่านทราบผ่านทางหน้าเว็บไซต์ 
      <a href="https://thems.moph.go.th/privacy-policy" target="_blank" rel="noopener noreferrer" style={{ color: '#007bff', textDecoration: 'underline', marginLeft: '4px' }}>
       https://thems.moph.go.th/privacy-policy 
  </a>
      </p>
      <h2 style={styles.subtitle}>
      ข้อ 11 การติดต่อสอบถามหรือใช้สิทธิ
      </h2>
      <p style={styles.text}>
      หากมีข้อสงสัย ข้อเสนอแนะหรือข้อกังวลเกี่ยวกับการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของผู้ให้บริการเว็บไซต์ หรือเกี่ยวกับประกาศนี้ หรือต้องการใช้สิทธิตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล สามารถติดต่อสอบถามได้ที่ 
      </p>
      <div style={{ display: 'flex', flexWrap: 'wrap', gap: '20px', marginTop: '20px', textAlign:'left' }}>
  <div style={{ flex: '1 1 300px', lineHeight: '1.6' }}>
    <strong>กลุ่มงานพัฒนาระบบสนับสนุนบริการ กองบริหารการสาธารณสุข</strong><br />
    88/22 หมู่ 4 อาคาร 3 ชั้น 5<br />
    ตึกสำนักงานปลัดกระทรวงสาธารณสุข<br />
    ถนนติวานนท์ ต.ตลาดขวัญ อ.เมือง จ.นนทบุรี 11000<br />
    โทร : +660-2590-1635<br />
    โทรสาร : +660-2590-1641<br />
    E-mail: <a href="mailto:env.moph2@gmail.com" style={{ color: '#007bff', textDecoration: 'underline' }}>env.moph2@gmail.com</a><br />
    โทร : +660-2590-1542<br />
    โทรสาร : +660-2590-1760 <br />
    E-mail: <a href="mailto:envecon@hitap.net" style={{ color: '#007bff', textDecoration: 'underline' }}>envecon@hitap.net</a>
  </div>
  
  <div style={{ flex: '1 1 300px', lineHeight: '1.6' }}>
    <strong>ฝ่ายเศรษฐศาสตร์สิ่งแวดล้อม มูลนิธิเพื่อการประเมินเทคโนโลยีและนโยบายด้านสุขภาพ</strong><br />
    สำนักงานใหญ่ : 88/22 หมู่ที่ 4 อาคาร 6 ชั้น 6<br />
    กรมอนามัย กระทรวงสาธารณสุข<br />
    ถนนติวานนท์ ตำบลตลาดขวัญ<br />
    อำเภอเมืองนนทบุรี จังหวัดนนทบุรี 11000<br />
    โทร : +662-590-4549<br/> 
    โทรสาร : +662-590-4369<br/> 
    E-mail: <a href="mailto:envecon@hitap.net" style={{ color: '#007bff', textDecoration: 'underline' }}>envecon@hitap.net</a>
  </div>
</div>
      <p style={styles.text}>ประกาศ ณ วันที่ 24 มีนาคม พ.ศ.2568</p>
    </div>
    </div>
  );
};

const styles = {
  container: {
    padding: "20px",
    maxWidth: "1300px",
    margin: "auto",
    fontFamily: "'Arial', sans-serif",
    lineHeight: "1.6",
    background:"#EFF5F3",
    borderRadius: "60px"
  },
  title: {
    textAlign: "center",
    fontSize: "28px",
    fontWeight: "bold",
  },
  subtitle: {
    fontSize: "20px",
    fontWeight: "bold",
    marginTop: "20px",
    display: "flex",
    textAlign: "left",
  },
  subtitle2: {
    fontSize: "17px",
    marginTop: "20px",
    display: "flex",
    marginLeft: "30px",
    textAlign: "left",
  },
  subtitle3: {
    fontSize: "17px",
    marginTop: "20px",
    display: "flex",
    marginLeft: "80px",
    textAlign: "left",
  },
  text: {
    fontSize: "16px",
    textAlign: "justify",
    marginBottom: "10px",
    marginTop: "20px"
  },
  text2: {
    fontSize: "16px",
    textAlign: "justify",
    marginBottom: "10px",
    marginLeft: "80px",
  },
  list: {
    paddingLeft: "20px",
    textAlign: "justify",
  },
};

export default PrivacyPolicyTH;
