import React, { useEffect } from "react";

const TermsTH = () => {
    useEffect(() => {
        document.title =  "ข้อกำหนดการใช้งาน";
      }, []);
  return (
    <div>
      <div style={styles.container}>
        <h1 style={{ ...styles.title, color: "#00A397" }}>ข้อตกลงการใช้งาน</h1>
        <p style={styles.subtitle}>คำนำ</p>
        <p style={styles.subtitle2}>
          ระบบฐานข้อมูลการบริหารจัดการก๊าซเรือนกระจกจากโรงพยาบาลรัฐ
          (ต่อไปนี้เรียกว่า Thai Hospital Emissions Management System หรือ
          THEMS) เป็นระบบที่จัดทำและดำเนินการโดยความร่วมมือของ
          กองบริหารการสาธารณสุข
          และมูลนิธิโครงการประเมินเทคโนโลยีและนโยบายด้านสุขภาพ
          (ต่อไปนี้เรียกรวมกันว่า “ผู้ให้บริการเว็บไซต์”)
          โดยการใช้งานเว็บไซต์นี้จะอยู่ภายใต้ข้อตกลงการใช้งานฉบับนี้
          รวมถึงที่อาจแก้ไขเพิ่มเติมเป็นครั้งคราวในอนาคต (“ข้อตกลงการใช้งาน”)
          ทั้งนี้ ท่านจะต้องอ่านข้อตกลงการใช้งานนี้ร่วมกับนโยบายความเป็นส่วนตัว
          รวมถึง ข้อตกลง เงื่อนไข หรือข้อสงวนสิทธิ์ใดๆ
          ที่อาจจัดให้มีเป็นการเฉพาะบนหน้าเว็บไซต์ (“ข้อตกลงที่ใช้บังคับ”)
        </p>
        <p style={styles.subtitle2}>
          โดยการใช้งานเว็บไซต์นี้
          ท่านยอมรับและตกลงที่จะผูกพันและปฏิบัติตามข้อตกลงที่ใช้บังคับทั้งหมด
          หากท่านไม่ยอมรับข้อตกลงดังกล่าว
          ท่านจะไม่มีสิทธิเข้าใช้งานเว็บไซต์หรือใช้บริการใดๆ บนเว็บไซต์
        </p>
        <p style={styles.subtitle}>การใช้บังคับ</p>
        <p style={styles.subtitle2}>
          ข้อตกลงการใช้งานนี้ใช้บังคับในการกำกับดูแลเว็บไซต์
          รวมตลอดจนถึงแอปพลิเคชัน ซอฟต์แวร์ เนื้อหา และบริการใดๆ
          (เรียกรวมกันว่า”บริการ”) ที่ปรากฏบนเว็บไซต์นี้
          และให้ใช้บังคับแก่ผู้ใช้งานเว็บไซต์ทุกท่าน ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ
          ผู้เยี่ยมชมเว็บไซต์ ผู้ใช้งานที่มีบัญชีผู้ใช้งานกับเว็บไซต์
        </p>
        <p style={styles.subtitle}>ข้อมูลส่วนบุคคล</p>
        <p style={styles.subtitle2}>
          ผู้ให้บริการเว็บไซต์อาจเก็บและประมวลผลข้อมูลส่วนบุคคลของผู้ใช้งานเว็บไซต์
          โดยขอแนะนำให้ท่านอ่าน นโยบายคุ้มครองข้อมูลส่วนบุคคล
          เพื่อทำความเข้าใจรายละเอียดเพิ่มเติมเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลของท่านโดยผู้ให้บริการเว็บไซต์ก่อนการเริ่มใช้งานเว็บไซต์ต่อไป
        </p>
        <p style={styles.subtitle}>วัตถุประสงค์</p>
        <p style={styles.subtitle2}>
          ระบบ THEMS
          เป็นฐานข้อมูลระดับประเทศที่พัฒนาขึ้นโดยมีวัตถุประสงค์เพื่อเก็บรวบรวม
          ประมวลผล
          และรายงานข้อมูลเกี่ยวกับการปล่อยก๊าซเรือนกระจกจากโรงพยาบาลของรัฐ
          ทั้งหมด 903 โรงพยาบาลที่อยู่ภายใต้การกำกับดูแลของกองบริหารการสาธารณสุข
        </p>
        <p style={styles.subtitle2}>
          ผู้ใช้งานเว็บไซต์ทั้งหมดจะสามารถเข้าถึงข้อมูลและการแสดงผล (Dashboard)
          ต่างๆ
          โดยรายละเอียดของข้อมูลที่สามารถเข้าถึงได้จะขึ้นอยู่กับระดับของผู้ใช้งานนั้นๆ
          โดยผู้ใช้งานดังกล่าวจะสามารถอ้างถึงหรืออ้างอิงข้อมูลดังกล่าวได้เพื่อวัตถุประสงค์ที่ไม่ใช่การค้า
          หรือการใช้งานที่เป็นธรรม (fair use) นอกจากนี้
          ผู้ใช้งานบางประเภทอาจได้รับสิทธิให้นำเข้าเนื้อหาหรือข้อมูลใดๆ
          ลงบนเว็บไซต์เป็นครั้งคราว (“วัตถุประสงค์ที่ได้รับอนุญาต”)
        </p>
        <p style={styles.subtitle}>เงื่อนไขทั่วไป</p>
        <p style={styles.subtitle3}>
          1. โดยที่ท่านยอมรับข้อตกลงการใช้งานฉบับนี้แล้ว
          ท่ารับรองและรับประกันว่าท่านบรรลุนิติภาวะตามกฎหมายของประเทศที่ท่านอยู่อาศัย
          และ/หรือ มีความสามารถในการเข้าทำนิติกรรมให้มีผลผูกพันตัวท่าน
        </p>
        <p style={styles.subtitle3}>
          2. ท่านตกลงจะใช้เว็บไซต์นี้เพื่อวัตถุประสงค์ที่ชอบด้วยกฎหมายเท่านั้น
        </p>
        <p style={styles.subtitle3}>
          3.
          ท่านตกลงจะปฏิบัติตามกฎหมายและกฎระเบียบเกี่ยวกับกิจกรรมออนไลน์ในประเทศที่ท่านอาศัยอยู่
          หรือในประเทศที่ท่านได้เข้าถึงเว็บไซต์นี้ท่านตกลงจะปฏิบัติตามกฎหมายและกฎระเบียบเกี่ยวกับกิจกรรมออนไลน์ในประเทศที่ท่านอาศัยอยู่
          หรือในประเทศที่ท่านได้เข้าถึงเว็บไซต์นี้
        </p>
        <p style={styles.subtitle3}>
          4. ท่านตกลงว่าจะไม่ใช้ความพยายามในการแทรกแซงเครือข่าย
          หรือการรักษาความมั่นคงปลอดภัยต่างๆ ของเว็บไซต์
          หรือใช้ความพยายามในการเข้าถึงระบบของเว็บไซต์โดยไม่ได้รับอนุญาต
        </p>
        <p style={styles.subtitle3}>
          5. เนื้อหาที่ปรากฏในหน้าต่างๆ
          บนเว็บไซต์เป็นข้อมูลที่ท่านสามารถใช้และอ้างอิงได้โดยทั่วไปเท่านั้น
        </p>
        <p style={styles.subtitle3}>
          6. ท่านรับทราบว่าผู้ให้บริการเว็บไซต์ขอสงวนสิทธิในการปรับปรุงเว็บไซต์
          รวมตลอดจนถึงยกเลิก แก้ไข
          ระงับหรือยุติการให้บริการบนเว็บไซต์ในส่วนใดส่วนหนึ่งได้ไม่ว่าเวลาในใดๆ
          โดยไม่จำเป็นต้องแจ้งเตือนท่าน นอกจากนี้
          ผู้ให้บริการเว็บไซต์อาจตั้งกฎระเบียบหรือข้อจำกัดในการใช้งานเว็บไซต์ได้เช่นกัน
        </p>
        <p style={styles.subtitle3}>
          7. ในกรณีที่ท่านได้รับสิทธิให้นำเข้าเนื้อหาหรือข้อมูลใดๆ
          ท่านรับรองว่าเนื้อหาหรือข้อมูลดังกล่าวเป็นความจริง ถูกต้อง
          และชอบด้วยกฎหมาย
          ท่านตกลงให้สิทธิแก่ผู้ให้บริการเว็บไซต์ในการใช้หรือเผยแพร่เนื้อหาหรือข้อมูลดังกล่าวโดยไม่คิดค่าใช้จ่าย
        </p>
        <p style={styles.subtitle3}>
          8. ผู้ให้บริการเว็บไซต์อาจลบเนื้อหาหรือข้อมูลที่ท่านได้นำเข้าตามข้อ 7
          ในกรณีที่ผู้ให้บริการเห็นว่าเป็นข้อมูลที่ไม่ถูกต้อง ไม่ชอบด้วยกฎหมาย
          ใช้ในทางที่ไม่ชอบ หรือฝ่าฝืนข้อตกลงการใช้งานนี้
          หรือในกรณีที่ผู้ให้บริการได้รับอนุญาตหรือมีหน้าที่ตามกฎหมายในการดำเนินการ
        </p>
        <p style={styles.subtitle}>ข้อจำกัดการใช้งาน</p>
        <p style={styles.subtitle2}>
          ท่านตกลงว่าจะไม่ใช้ พยายามจะใช้ ให้ความช่วยเหลือบุคคลใดๆ
          ในการใช้หรือพยายามใช้งานลักษณะดังต่อไปนี้
        </p>
        <p style={styles.subtitle3}>
          1. การใช้เว็บไซต์หรือบริการเพื่อวัตถุประสงค์ที่ไม่ชอบด้วยกฎหมาย
          หรือวัตถุประสงค์ใดๆ ที่ท่านไม่มีสิทธิ รวมถึงแต่ไม่จำกัดเฉพาะ
          การใช้งานที่เป็นการละเมิดทรัพย์สินทางปัญญา หรือกฎหมายอื่นใด
        </p>
        <p style={styles.subtitle3}>
          2. การใช้งานเว็บไซต์หรือบริการเพื่อวัตถุประสงค์ทางการค้า
          เว้นแต่ท่านจะได้รับอนุญาตโดยชัดแจ้งเป็นลายลักษณ์อักษรจากผู้ให้บริการเว็บไซต์
        </p>
        <p style={styles.subtitle3}>
          3. การใช้งานข้อมูลใดๆ ที่ปรากฏอยู่บนเว็บไซต์
          หรือในส่วนหนึ่งส่วนใดของบริการ
          หรือผลงานเพื่อพัฒนาหรือทำให้ระบบคอมพิวเตอร์เกิดการเรียนรู้ (Machine
          Learning) หรือเทคโนโลยีอื่นๆ ในที่เกี่ยวข้องกัน
        </p>
        <p style={styles.subtitle3}>
          4. การใช้อุปกรณ์ ชุดคำสั่ง หรือวิธีการใดๆ เพื่อทำวิศวกรรมย้อนกลับ
          ถอดรหัส หรือค้นหารหัสต้นทาง (Source Code)
          หรือส่วนประกอบพื้นฐานของเว็บไซต์ แอปพลิเคชัน ซอฟต์แวร์ หรือส่วนใดๆ
          ของบริการ
        </p>
        <p style={styles.subtitle3}>
          5. การใช้ปัญญาประดิษฐ์ ระบบ Machine Learning ชุดคำสั่ง ซอฟต์แวร์
          หรืออุปกรณ์หรือวิธีการใดๆ เพื่อใช้ เข้าถึง ทำดัชนีข้อมูล ทำซ้ำข้อมูล
          ปรับปรุง ถอดรหัส ทำวิศวกรรมย้อนกลับ สร้างงานสร้างสรรค์ต่อเนื่อง
          (Derivative Works) เก็บรวบรวมข้อมูล จากข้อมูล
          หรือเนื้อหาที่สามารถพบหรือเข้าถึงได้บนเว็บไซต์หรือบริการ
        </p>
        <p style={styles.subtitle3}>
          6. การใช้องค์ประกอบใดๆ ที่อาจทำให้เกิดอันตรายต่อเว็บไซต์ บริการ
          หรือระบบคอมพิวเตอร์ของบุคคลอื่นๆ รวมถึงแต่ไม่จำกัดเฉพาะ ไวรัส รหัส
          หนอนคอมพิวเตอร์ (Computer Worms) ไฟล์ หรือโปรแกรมอื่นใด
          ที่ถูกออกแบบให้ทำลายบริการบนเว็บไซต์หรืออนุญาตให้มีการเข้าถึงโดยไม่ชอบ
        </p>
        <p style={styles.subtitle}>กรรมสิทธิ์</p>
        <p style={styles.subtitle3}>
          1.
          เนื้อหาทั้งหมดที่เผยแพร่และปรากฏบนเว็บไซต์เป็นทรัพย์สินทางปัญญาของเว็บไซต์
          ไม่ว่าจะเป็นรูปภาพ ข้อความ เอกสาร ไฟล์ข้อมูลที่สามารถบันทึกได้
          รวมถึงองค์ประกอบอื่นๆ ที่ประกอบเป็นเว็บไซต์นี้
        </p>
        <p style={styles.subtitle3}>
          2.
          ผู้ให้บริการเว็บไซต์ให้สิทธิอันจำกัดแก่ท่านในการเข้าถึงและใช้งานเว็บไซต์
          เนื้อหา และบริการบนเว็บไซต์เพื่อวัตถุประสงค์ที่ได้รับอนุญาต
          โดยที่สิทธินั้นไม่สามารถโอนหรือช่วงสิทธิได้และผู้ให้บริการอาจเพิกถอนได้
          และท่านตกลงว่าท่านไม่มีสิทธิในการแก้ไขเปลี่ยนแปลง ขาย
          หรือสร้างงานสร้างสรรค์ต่อเนื่อง (Derivative Works)
          โดยใช้เนื้อหาบนเว็บไซต์นั้นไม่ว่าทั้งหมดหรือบางส่วน
          เว้นแต่ได้รับอนุญาตโดยชัดแจ้งเป็นลายลักษณ์อักษรจากผู้ให้บริการเว็บไซต์
        </p>
        <p style={styles.subtitle3}>
          3. ผู้ให้บริการเว็บไซต์ไม่มีเจตนาจะโอนผลประโยชน์ใดๆ ในบริการ เนื้อหา
          หรือข้อมูลที่ปรากฏบนเว็บไซต์ให้แก่บุคคลใดๆ
          โดยท่านตกลงว่าท่านจะไม่ทำซ้ำหรือส่งต่อทรัพย์สินทางปัญญาบนเว็บไซต์นี้ไม่ว่าด้วยพฤติการณ์ใดๆ
          โดยไม่ได้รับอนุญาตจากผู้ให้บริการ
        </p>
        <p style={styles.subtitle}>การเชื่อมโยงไปยังเว็บไซต์อื่น</p>
        <p style={styles.subtitle2}>
          เว็บไซต์นี้อาจมีการเชื่อมโยงไปยังเว็บไซต์อื่นๆ เป็นครั้งคราว
          ซึ่งการเชื่อมโยงดังกล่าวเป็นเพียงการให้ข้อมูลเพิ่มเติมเพื่อช่วยอำนวยความสะดวกแก่ท่าน
          โดยที่ผู้ให้บริการเว็บไซต์นี้ไม่ได้มีหน้าที่ตรวจสอบ รับรอง อนุมัติ
          หรือควบคุม หรือมีหน้าที่รับผิดชอบหน้าเว็บไซต์ที่ถูกเชื่อมโยงไป
          ตลอดจนเนื้อหา หรือบุคคลภายนอก และบริการที่เกี่ยวข้อบนเว็บไซต์เหล่านั้น
          ดังนั้น
          ผู้ให้บริการเว็บไซต์ขอสงวนสิทธิในการรับผิดชอบเกี่ยวกับเว็บไซต์ที่เชื่อมโยงไป
        </p>
        <p style={styles.subtitle}>บัญชีผู้ใช้งาน</p>
        <p style={styles.subtitle3}>
          1. ในกรณีที่ท่านเป็นผู้ใช้งานที่มีบัญชีผู้ใช้งานเว็บไซต์
          ท่านอาจต้องสร้างบัญชีผู้ใช้งานและให้ข้อมูลบางประการแก่ผู้ให้บริการเว็บไซต์เพื่อใช้เป็นส่วนหนึ่งในกระบวนการสร้างบัญชีผู้ใช้งาน
          โดยท่านตกลงดังต่อไปนี้
        </p>
        <p style={styles.text2}>
          1. ข้อมูลส่วนบุคคลหรือข้อมูลใดๆ ที่ท่านให้ไว้
          เป็นข้อมูลที่เป็นความจริง ถูกต้อง และเป็นปัจจุบัน
        </p>
        <p style={styles.text2}>
          2. ท่านจะรับผิดชอบบัญชีผู้ใช้งาน
          และความมั่นคงปลอดภัยและความเป็นส่วนตัวของบัญชีผู้ใช้งานของท่าน
          รวมถึงรหัสผ่าน หรือข้อมูลใดๆ ที่บันทึกในบัญชีนั้นๆ
        </p>
        <p style={styles.text2}>
          3. ท่านตกลงจะไม่เปิดเผยรหัสผ่านของท่านแก่บุคคลภายนอกที่ไม่เกี่ยวข้อง
        </p>
        <p style={styles.text2}>
          4.
          ท่านจะรับผิดชอบต่อกระทำทั้งหมดที่เกิดขึ้นภายใต้บัญชีผู้ใช้งานของท่าน
        </p>
        <p style={styles.text2}>
          5. ท่านจะต้องแจ้งผู้ให้บริการเว็บไซต์ทราบทันที
          เมื่อมีการเข้าถึงหรือใช้งานรหัสผ่านโดยไม่ได้รับอนุญาต
        </p>
        <p style={styles.subtitle3}>
          2.
          ในกรณีที่ท่านรับทราบถึงการเข้าถึงบัญชีผู้ใช้งานของท่านโดยไม่ได้รับอนุญาต
          หรือปัญหาใดๆ เกี่ยวกับความมั่นคงปลอดภัยของบัญชีผู้ใช้งาน
          ท่านจะต้องแจ้งให้ผู้ให้บริการเว็บไซต์ทราบโดยทันทีเพื่อที่จะได้แก้ไขปัญหาที่เกิดขึ้นได้ทันท่วงที
        </p>
        <p style={styles.subtitle3}>
          3. ในกรณีที่บัญชีผู้ใช้งานเป็นบัญชีใช้งานร่วมกันในระดับองค์กร
          หรือบัญชีที่ถือครองโดยคณะบุคคล
          ให้องค์กรหรือคณะบุคคลนั้นร่วมกันรับผิดชอบในการปฏิบัติตามเงื่อนไขในนี้
          ข้อตกลงการใช้งานทั้งหมด
        </p>
        {/* <p style={styles.subtitle3}>
          4. We reserve the right to edit, suspend, terminate your account at
          any time and for any reason at out sole discretion.
        </p> */}
        <p style={styles.subtitle}>การสิ้นสุดการให้บริการ</p>
        <p style={styles.subtitle3}>
          1. ผู้ให้บริการขอสงวนสิทธิในการแก้ไข ระงับ ยกเลิกบัญชีผู้ใช้งานของท่าน
          หรือบริการบนเว็บไซต์ ไม่ว่าในเวลาใดๆ และด้วยเหตุผลใดๆ
          โดยดุลยพินิจของผู้ให้บริการเว็บไซต์แต่เพียงผู้เดียว
        </p>
        <p style={styles.subtitle3}>
          2. เมื่อได้ระงับหรือยกเลิกบริการดังกล่าวแล้ว
          ท่านจะต้องทำลายสำเนาข้อมูลใดๆ ที่ท่านนำมาจากเนื้อหาบนเว็บไซต์
          โดยการเข้าถึงเว็บไซต์ผ่านบัญชีผู้ใช้งานเดิมถือว่าเป็นการกระทำอันเป็นการบุกรุก
        </p>
        <p style={styles.subtitle3}>
          3. ท่านตกลงว่าผู้ให้บริการเว็บไซต์ไม่มีความรับผิดใดๆ
          ต่อท่านหรือบุคคลภายนอกอันเนื่องมาจากการยกเลิกหรือระงับการเข้าถึงเว็บไซต์ปละบริการต่างๆ
        </p>
        <p style={styles.subtitle}>การปฏิเสธความรับผิด</p>
        <p style={styles.subtitle2}>
          ผู้ให้บริการให้บริการเว็บไซต์นี้ตามสภาพ โดยปราศจากคำรับรอง คำรับประกัน
          หรือเงื่อนไข ไม่ว่าประเภทใดๆ
          และผู้ให้บริการไม่รับประกันในกรณีดังต่อไปนี้ตราบเท่าที่กฎหมายอนุญาต
        </p>
        <p style={styles.subtitle3}>
          1. บริการบนเว็บไซต์จะมีความมั่นคงปลอดภัย และมีสภาพพร้อมใช้งานได้ไม่ว่า
          ณ เวลาใดๆ หรือสถานที่ใดๆ
        </p>
        <p style={styles.subtitle3}>
          2. บริการบนเว็บไซต์จะปราศจากไวรัส หรือส่วนประกอบอื่นๆ ที่อันตราย
        </p>
        <p style={styles.subtitle3}>
          3. บริการบนเว็บไซต์จะปราศจากการละเมิดสิทธิใดๆ
        </p>
        <p style={styles.subtitle3}>
          4. ความบกพร่องหรือข้อผิดพลาดใดๆ บนเว็บไซต์จะได้รับการแก้ไขทั้งหมด
        </p>
        <p style={styles.subtitle3}>
          5.
          คุณภาพหรือผลการใช้บริการจะเป็นไปตามความคาดหวังหรือบรรลุวัตถุประสงค์ของท่าน
        </p>
        <p style={styles.subtitle}>ข้อจำกัดความรับผิด</p>
        <p style={styles.subtitle3}>
          1. ท่านตกลงว่าท่านจะรับความเสี่ยงใดๆ
          อันเกิดจากการใช้งานเว็บไซต์นี้ไว้แต่เพียงผู้เดียว
          และท่านจะรับภาระหน้าที่เกี่ยวกับค่าใช้จ่ายใดๆ
          ที่เกี่ยวข้องกับการใช้งานเว็บไซต์ด้วยตนเอง ทั้งนี้
          ผู้ให้บริการเว็บไซต์ขอยกเว้นความรับผิดต่อความเสียหายไม่ว่าประเภทใดๆ
          อันเกี่ยวกับการใช้งานเว็บไซต์ไว้โดยชัดแจ้ง
          ทั้งนี้ตราบเท่าที่กฎหมายอนุญาตให้กระทำได้
        </p>
        <p style={styles.subtitle3}>
          2. ท่านตกลงว่าผู้ให้บริการเว็บไซต์ไม่จำต้องรับผิดต่อท่าน
          หรือบุคคลภายนอกใดๆ สำหรับการปรับปรุงแก้ไข การระงับ
          หรือการยุติการให้บริการเว็บไซต์ บริการ เนื้อหา หรือคุณลักษณะใดๆ
          ที่มีอยู่บนเว็บไซต์
        </p>
        <p style={styles.subtitle3}>
          3. ผู้ให้บริการเว็บไซต์ ตลอดจนผู้ให้บริการที่เกี่ยวข้อง กรรมการ
          เจ้าหน้าที่ ตัวแทน คู่สัญญา ผู้จัดจำหน่าย
          หรือพนักงานของผู้ให้บริการจะไม่รับผิดต่อท่านไม่ว่ากรณีใดๆ
          สำหรับความเสียหายโดยตรง โดยอ้อม ความเสียหายพิเศษ (incidental damage)
          ความเสียหายเนื่องมาจากสัญญา ความเสียหายต่อเนื่อง (consequential
          damage) ความเสียหายเชิงลงโทษ (exemplary or punitive damage) ความสูญหาย
          การเสียรายได้ การเสียผลกำไร ธุรกิจหรือยอดขาย
          หรือความเสียหายประเภทอื่นๆ ไม่ว่าจะเกิดขึ้นจากสัญญา หรือการละเมิดสิทธิ
          (รวมถึงการกระทำโดยประมาท) ความรับผิดโดยเด็ดขาด
          หรือความรับผิดที่เกิดขึ้นจากการใช้งาน การไม่สามารถใช้งาน
          การทำงานของเว็บไซต์ หรือเนื้อหา หรือส่วนประกอบหรือการทำงานใดๆ
          บนเว็บไซต์
          แม้ว่าท่านจะได้แจ้งให้ผู้ให้บริการเว็บไซต์ทราบถึงความเป็นไปได้ที่จะเกิดความเสียหายดังกล่าวข้างต้นแล้วก็ตาม
        </p>
        <p style={styles.subtitle}>การชดใช้ความเสียหาย</p>
        <p style={styles.subtitle2}>
        ท่านตกลงชดใช้ความเสียหาย และปกป้องผู้ให้บริการเว็บไซต์ เจ้าหน้าที่ กรรมการ พนักงาน หรือตัวแทนของผู้ให้บริการเว็บไซต์จากการเรียกร้อง ความรับผิด ความเสียหาย สูญหาย ค่าใช้จ่าย ข้อเรียกร้อง รวมถึงแต่ไม่จำกัดเฉพาะค่าบริการและค่าใช้จ่ายของที่ปรึกษากฎหมาย อันเกิดจากการเข้าถึง การใช้ หรือการใช้ในทางที่ผิด หรือการละเมิดต่อข้อตกลงการใช้งานฉบับนี้
        </p>
        <p style={styles.subtitle}>การสละสิทธิ์</p>
        <p style={styles.subtitle2}>
        การที่ผู้ให้บริการเว็บไซต์ไม่ใช้หรือบังคับตามสิทธิหรือตามข้อตกลงการใช้งานฉบับนี้ ไม่ถือว่าเป็นการสละสิทธิ์หรือข้อตกลงนั้น นอกจากนี้ การสละสิทธิ์ของผู้ให้บริการเว็บไซต์ไม่ให้มีผลจนกว่าจะได้แจ้งการสละสิทธิ์เป็นลายลักษณ์อักษรแก่ท่าน
        </p>
        <p style={styles.subtitle}>การแก้ไขเปลี่ยนแปลงข้อตกลงการใช้งาน</p>
        <p style={styles.subtitle2}>
        ข้อตกลงการใช้งานนี้อาจได้รับการแก้ไขหรือปรับปรุงเป็นครั้งคราวตามดุลยพินิจของผู้ให้บริการเว็บไซต์ โดยไม่ต้องแจ้งให้ทราบล่วงหน้า เพื่อที่จะให้สอดคล้องกับกฎหมาย และสะท้อนถึงวิธีการที่เราจัดการเว็บไซต์ หรือสะท้อนถึงแนวทางที่เราประสงค์ให้ผู้ใช้งานเว็บไซต์ปฏิบัติในการใช้งานเว็บไซต์ ทั้งนี้ ให้ถือว่าท่านตกลงยอมรับการแก้ไขเปลี่ยนแปลงข้อตกลงการใช้งาน ถ้าหากท่านยังคงใช้งานเว็บไซต์ต่อไป
        </p>
        <p style={styles.subtitle}>กฎหมายที่ใช้บังคับ</p>
        <p style={styles.subtitle2}>
        ข้อตกลงการใช้งานนี้ให้ตีความและบังคับใช้โดยกฎหมายแห่งราชอาณาจักรไทย และให้ศาลไทยมีเขตอำนาจในการระงับข้อพิพาทใดๆ อันเกิดจากข้อตกลงการใช้งานนี้หรือการใช้งานเว็บไซต์แต่เพียงผู้เดียว
        </p>
        <p style={styles.subtitle}>รายละเอียดการติดต่อ</p>
        <p style={styles.subtitle2}>
        ในกรณีที่ท่านมีคำถาม โปรดสอบถามได้ที่
        </p>
        <div style={{ display: 'flex', flexWrap: 'wrap', gap: '20px', marginTop: '20px', textAlign:'left', marginLeft: "30px" }}>
  <div style={{ flex: '1 1 300px', lineHeight: '1.6' }}>
    <strong>กลุ่มงานพัฒนาระบบสนับสนุนบริการ กองบริหารการสาธารณสุข</strong><br />
    88/22 หมู่ 4 อาคาร 3 ชั้น 5<br />
    ตึกสำนักงานปลัดกระทรวงสาธารณสุข<br />
    ถนนติวานนท์ ต.ตลาดขวัญ อ.เมือง จ.นนทบุรี 11000<br />
    โทร : +660-2590-1635<br />
    โทรสาร : +660-2590-1641<br />
    E-mail: <a href="mailto:env.moph2@gmail.com" style={{ color: '#007bff', textDecoration: 'underline' }}>env.moph2@gmail.com</a><br />
    โทร : +660-2590-1542<br />
    โทรสาร : +660-2590-1760 <br />
    E-mail: <a href="mailto:envecon@hitap.net" style={{ color: '#007bff', textDecoration: 'underline' }}>envecon@hitap.net</a>
  </div>
  
  <div style={{ flex: '1 1 300px', lineHeight: '1.6' }}>
    <strong>ฝ่ายเศรษฐศาสตร์สิ่งแวดล้อม มูลนิธิเพื่อการประเมินเทคโนโลยีและนโยบายด้านสุขภาพ</strong><br />
    สำนักงานใหญ่ : 88/22 หมู่ที่ 4 อาคาร 6 ชั้น 6<br />
    กรมอนามัย กระทรวงสาธารณสุข<br />
    ถนนติวานนท์ ตำบลตลาดขวัญ<br />
    อำเภอเมืองนนทบุรี จังหวัดนนทบุรี 11000<br />
    โทร : +662-590-4549<br/> 
    โทรสาร : +662-590-4369<br/> 
    E-mail: <a href="mailto:envecon@hitap.net" style={{ color: '#007bff', textDecoration: 'underline' }}>envecon@hitap.net</a>
  </div>
</div>
      </div>
    </div>
  );
};

const styles = {
  container: {
    padding: "20px",
    maxWidth: "1300px",
    margin: "auto",
    fontFamily: "'Arial', sans-serif",
    lineHeight: "1.6",
    background: "#EFF5F3",
    borderRadius: "60px",
  },
  title: {
    textAlign: "center",
    fontSize: "28px",
    fontWeight: "bold",
  },
  subtitle: {
    fontSize: "20px",
    fontWeight: "bold",
    marginTop: "20px",
    display: "flex",
    textAlign: "left",
    textDecoration: "underline",
  },
  subtitle2: {
    fontSize: "17px",
    marginTop: "20px",
    display: "flex",
    marginLeft: "30px",
    textAlign: "left",
  },
  subtitle3: {
    fontSize: "17px",
    marginTop: "20px",
    display: "flex",
    marginLeft: "50px",
    textAlign: "left",
  },
  text: {
    fontSize: "16px",
    textAlign: "justify",
    marginBottom: "10px",
    marginTop: "20px",
  },
  text2: {
    fontSize: "16px",
    textAlign: "justify",
    marginBottom: "10px",
    marginLeft: "80px",
  },
};

export default TermsTH;
